package HomeWork;


import java.io.IOException;

/**
 * Created by мори on 04.07.2017.
 *
 *
 1. Написать класс, в котором будет метод, который проверяет, сколькими сторонами кирпич пролезет через отверстие заданного диаметра (входные параметры - x, y, z кирпича и диаметр отверстия)
 2. Дан массив целых чисел (несортированный, с повторами). Найти три наименьших числа в нем. Возвращать массив размером 3 с этими числами.
 3. Дан массив чисел. Написать метод, который удаляет число с конкретным индексом и возвращает новый массив без этого числа.
 4. Написать класс, имплементирующий Comparable, в котором есть два целочисленных поля - месяц и день,
 так, чтоб сначала сравнивались месяцы, потом дни. (Проверить потом можно через Arrays.parallelSort())
 5. Найти частное и остаток от деления двух чисел используя только сложение и вычитание.
 6. Написать программу, которая будет считать n-ный элемент последовательности
 Трибоначчи (каждый следующий элемент - сумма трех предыдущих). И циклом, и рекурсивно. Сравнить быстродействие.
 */
public class Lesson5 {

    public static void main(String[] args) throws IOException {

        CommonMenu.menu();

    }
}
